const MRCP = {
    '2022-05-07': [17, 14],
    '2022-08-14': [14, 12],
    '2023-01-15': [15, 13],
    '2023-05-26': [16, 14],
    '2023-10-12': [16, 14],
    '2024-03-08': [20, 16],
    '2024-08-13': [20, 18],
    '2025-02-13': [21, 18],
    '2025-08-18': [23, 19],
    '2026-02-24': [24, 20]
}

const biomarkers = { // CEA, CA199, CA125
    '2022-04-23': [0.3, 4.5, 8.7],
    '2022-05-07': ["", "", ""],
    '2022-08-14': [0.7, 4.1, ""],
    '2022-12-25': [0.7, 4.8, ""],
    '2023-01-15': ["", "", ""],
    '2023-05-26': [0.4, 4.5, 7.9],
    '2023-10-12': ["", 4.4, ""],
    '2024-03-08': [1.5, 4.1, ""],
    '2024-08-13': [0.6, 4.5, 10.5],
    '2025-02-13': ["", "", ""],
    '2025-08-18': [0.7, 4.9, 7.5],
    '2026-02-24': [0.7, 5.2, 8.2]
}

const notes = {
    '2023-05-26': "胆囊增大<br>胆汁淤积可能",
    '2023-10-12': "胆囊增大<br>胆汁淤积可能",
    '2024-03-08': "胆汁淤积可能<br>脂肪肝",
    '2024-08-13': "胆汁淤积可能<br>脂肪肝",
    '2025-02-13': "胆汁淤积可能",
    '2026-02-24': "右肾多发小囊肿<br>腹膜后多发小淋巴结"
}

const blood1 = {
    //'2022-04-23': {ALT: , TP: , Alb: , AG: , PA: , TBil: , DBil: , GGT: , ALP: , AST: , TBA: , LD: , ChE: , K: , Na: , Cl: , TCO2: , Ca: , cCa: , P: , Mg: , Cr: , Urea: , Glu: , UA: },
    '2022-04-11': {ALT: 25, TP: 75, Alb: 48, AG: 1.8, PA: 357, TBil: 33.2, DBil: 8.4, GGT: "", ALP: "", AST: "", TBA: "", LD: "", ChE: "", K: "", Na: "", Cl: "", TCO2: "", Ca: "", cCa: "", Mg: "", Cr: 83, Urea: 4.11, Glu: "", UA: ""},
    '2022-04-23': {ALT: 24, TP: 71, Alb: 44, AG: 1.6, PA: 322, TBil: 39.1, DBil: 9.1, GGT: 22, ALP: 70, AST: 18, TBA: 4.7, LD: 158, ChE: 9.7, K: 4.1, Na: 140, Cl: 104, TCO2: 27, Ca: 2.36, cCa: "", P: 1.02, P: "", Mg: "", Cr: 74, Urea: 5.05, Glu: 4.9, UA: 467},
    '2022-05-26': {ALT: 18, TP: 73, Alb: 46, AG: 1.7, PA: 326, TBil: 37.4, DBil: 9.5, GGT: 22, ALP: 74, AST: 19, TBA: 1.8, LD: 194, ChE: 9.2, K: 4.6, Na: 140, Cl: 104, TCO2: 27.2, Ca: 2.4, cCa: 2.28, P: 0.97, Mg: 0.95, Cr: 80, Urea: 5.11, Glu: 5.6, UA: 449},
    '2024-08-13': {ALT: 67, TP: 76, Alb: 48, AG: 1.7, PA: 322, TBil: 30.1, DBil: 7.6, GGT: 34, ALP: 76, AST: 31, TBA: 1.9, LD: 156, ChE: 10.1, K: 4.5, Na: 141, Cl: 104, TCO2: 29.7, Ca: 2.4, cCa: 2.24, P: 0.99, Mg: 0.88, Cr: 77, Urea: 4.01, Glu: 5.8, UA: 494},
    '2025-08-18': {ALT: 34, TP: 76, Alb: 48, AG: 1.7, PA: 327, TBil: 37.1, DBil: 9.7, GGT: 27, ALP: 68, AST: 25, TBA: 2.4, LD: 201, ChE: 9.8, K: 4.3, Na: 141, Cl: 104, TCO2: 26.4, Ca: 2.43, cCa: 2.27, P: 0.96, Mg: 0.94, Cr: 82, Urea: 5, Glu: 5.7, UA: 397},
    '2026-02-24': {ALT: 31, TP: 73, Alb: 48, AG: 1.9, PA: 321, TBil: 34.1, DBil: 9.2, GGT: 24, ALP: 62, AST: 23, TBA: 2.2, LD: 155, ChE: 10.2, K: 4.2, Na: 140, Cl: 104, TCO2: 26.9, Ca: 2.47, cCa: 2.31, P: 0.85, Mg: 0.91, Cr: 73, Urea: 4.7, Glu: 6.0, UA: 364},
}

const blood1_dsc = {
    ALT: ["丙氨酸氨<br>基转氨酶", 9, 50],
    TP: ["总蛋白", 60, 85],
    Alb: ["白蛋白<br>(BCG法)", 35, 52],
    AG: ["白蛋白球蛋白比", 1.0, 2.5],
    TBil: ["总胆红素", 5.1, 22.2],
    DBil: ["直接胆红素", 0, 6.8],
    GGT: ["谷氨酰胺转氨酶", 10, 60],
    ALP: ["碱性磷酸酶", 45, 125],
    AST: ["天门冬氨酸<br>氨基转移酶", 15, 40],
    TBA: ["总胆汁酸", 0, 10],
    LD: ["乳酸脱氢酶", 0, 250],
    ChE: ["胆碱酯酶", 5, 12],
    K: ["钾", 3.5, 5.5],
    Na: ["钠", 135, 145],
    Cl: ["氯", 96, 111],
    TCO2: ["总二氧化碳", 20, 34],
    Ca: ["钙", 2.11, 2.52],
    cCa: ["校正钙", 2.11, 2.52],
    Mg: ["镁", 0.7, 1.1],
    Cr: ["肌酐(酶法)", 59, 104],
    Urea: ["尿素", 2.8, 7.2],
    Glu: ["葡萄糖", 3.9, 6.1],
    UA: ["尿酸", 210, 416],
    P: ["无机磷", 0.85, 1.51],
    PA: ["前白蛋白", 200, 400]
}

const blood2 = {
    //"2024-08-13": {WBC: , LY1: , MONO1: , NEUT1: , EOS1: , BASO1: , LY2: , MONO2: , NEUT2: , EOS2: , BASO2: , RBC: , HGB: , HCT: , MCV: , MCHC: , MCH: , RDW_S: , RDW_C: , PLT: , PCT: , PDW: , MPV: , P_LCR: },
    "2024-08-13": {WBC: 6.37, LY1: 48, MONO1: 5.3, NEUT1: 44.2, EOS1: 1.9, BASO1: 0.6, LY2: 3.06, MONO2: 0.34, NEUT2: 2.81, EOS2: 0.12, BASO2: 0.04, RBC: 5.78, HGB: 173, HCT: 49.6, MCV: 85.8, MCHC: 349, MCH: 29.9, RDW_S: 37.1, RDW_C: 12, PLT: 313, PCT: 0.31, PDW: 11.3, MPV: 10, P_LCR: 25.1},
    "2025-08-18": {WBC: 7.72, LY1: 50.1, MONO1: 4.5, NEUT1: 43, EOS1: 1.9, BASO1: 0.5, LY2: 3.87, MONO2: 0.35, NEUT2: 3.31, EOS2: 0.15, BASO2: 0.04, RBC: 5.7, HGB: 173, HCT: 49.3, MCV: 86.5, MCHC: 351, MCH: 30.4, RDW_S: 38.3, RDW_C: 12.2, PLT: 299, PCT: 0.31, PDW: 12.3, MPV: 10.2, P_LCR: 27.8},
    "2026-02-24": {WBC: 7.26, LY1: 51.8, MONO1: 4.7, NEUT1: 41, EOS1: 1.9, BASO1: 0.6, LY2: 3.76, MONO2: 0.34, NEUT2: 2.98, EOS2: 0.14, BASO2: 0.04, RBC: 5.74, HGB: 170, HCT: 49.5, MCV: 86.2, MCHC: 343, MCH: 29.6, RDW_S: 36.4, RDW_C: 11.6, PLT: 298, PCT: 0.31, PDW: 12, MPV: 10.3, P_LCR: 28.5},
}

const blood2_dsc = {
    WBC: ["白细胞", 3.5, 9.5],
    LY1: ["淋巴细胞<br>百分比", 20, 40],
    MONO1: ["单核细胞<br>百分比", 3, 8],
    NEUT1: ["中性粒细胞<br>百分比", 50, 75],
    EOS1: ["嗜酸性粒细胞<br>百分比", 0.5, 5],
    BASO1: [ "嗜碱性粒细胞<br>百分比", 0, 1],
    LY2: [ "淋巴细胞<br>绝对值", 0.8, 4],
    MONO2: [ "单核细胞<br>绝对值", 0.12, 0.8],
    NEUT2: [ "中性粒细胞<br>绝对值", 2, 7.5],
    EOS2: [ "嗜酸性粒细胞<br>绝对值", 0.02, 0.5],
    BASO2: [ "嗜碱性粒细胞<br>绝对值", 0, 0.1],
    RBC: [ "红细胞", 4, 5.5],
    HGB: [ "血红蛋白", 120, 160],
    HCT: [ "红细胞压积", 35, 50],
    MCV: [ "平均红细胞体积", 82, 97],
    MCHC: [ "平均红细胞<br>血红蛋白浓度", 320, 360],
    MCH: [ "平均红细胞<br>血红蛋白含量", 27, 32],
    RDW_S: [ "红细胞体积<br>分布宽度(标准差)", 39, 46],
    RDW_C: [ "红细胞体积<br>分布宽度(变异系数)", 0, 15],
    PLT: [ "血小板", 100, 350],
    PCT: [ "血小板压积", 0.11, 0.28],
    PDW: [ "血小板体积<br>分布宽度", 9, 17],
    MPV: [ "平均血小板<br>体积", 7, 13],
    P_LCR: [ "大血小板<br>比率", 13, 43],
}