        const posts = [
            {
                id: 8,
                title: "儿子成长",
                excerpt: "儿子 成长 记录",
                content: `### 足迹

- **中国**
  - 北京、天津、秦皇岛、张家口、荣成、威海、烟台、锦州、唐山

### 成长大事记

- **2024年**
  - 2024-05-24 壮壮出生啦！🎉
  - 2024-05-27 爸爸第一次抱你
  - 2024-05-30 → 2024-06-04 离开爸妈独自因黄疸住院
  - 2024-06-09 你也是有户口的人啦
  - 2024-06-10 爸爸第一次教你英语
  - 2024-07-18 爷爷第一次抱你
  - 2024-08-15 你第一次翻身
  - 2024-10-20 → 2024-10-22 第一次带你去旅行，自驾带着你和妈妈去天津极地海洋馆旅游
  - 2024-10-23 你长出了第一颗牙
  - 2024-11-02 你吃了第一口辅食
  - 2024-11-16 你爬出了第一步
  - 2024-12-11 你第一次清晰的叫出了爸爸
  - 2024-12-29 你会叫妈妈了
- **2025年**
  - 2025-02-22 第一次坐S2线
  - 2025-05-06 你可以独自站起来行走了
  - 2025-05-19 第一次坐地铁
  - 2025-05-21 → 2025-05-23 爸爸妈妈自驾带着奶奶姥姥开车去秦皇岛蔚蓝海岸
  - 2025-07-07 爸爸妈妈带你去了南宫五洲植物乐园
  - 2025-08-18 → 2025-08-19 爸爸妈妈带你去了静之湖
  - 2025-08-22 → 2025-08-24 爸爸妈妈自驾带着你去了太舞小镇和富龙四季小镇
  - 2025-10-07 爸爸妈妈带你去了北京动物园
- **2026年**
  - 2026-05-11 第一次坐高铁
  - 2026-05-11 → 2026-05-16 爸爸妈妈带你去了山东荣成威海烟台
  - 2026-05-12 第一次坐游轮
  - 2026-05-16 第一次坐飞机
  - 2026-07-18 爸爸妈妈带你去了国家动物博物馆
  - 2026-07-26 爸爸妈妈带你去了北京汽车博物馆
  - 2026-08-01 爸爸妈妈带你去了中国国家地理探索中心·恐龙星球
  - 2026-08-19 你去托儿所的第一天，接送都没有哭
  - 2026-08-23 爸爸妈妈带你去了北京海洋馆
  - 2026-08-31 → 2026-09-03 妈妈去广州出差，爸爸哄我睡了4晚
`,
                category: "记录",
                date: "2026-02-12",
                tags: []
            },
            {
                id: 7,
                title: "奖项荣誉项目文章专利软著汇总",
                excerpt: "个人奖项 集体奖项 基金项目 软件著作 期刊论文 会议论文 发明专利",
                content: `### 个人奖项

- 2024 清华大学实验技术发展基金技术创新 二等奖
  - PB量级冷冻电镜数据压缩存储方法（杨涛、阮华斌、**唐贺**）
- 2024 清华大学生命学科校级平台“先进个人”二等奖
- 2022 清华大学生命学科校级平台“先进个人”三等奖

### 集体奖项

- 2025 国家蛋白质中心（北京）优秀技术平台
- 2025 清华大学生命学科校级平台“优秀机组”称号
  - 生物计算平台-X集群(冷冻电镜数据处理与分析集群)（杨涛、贾安宝、王亚坤、陈晋红、**唐贺**）
- 2025 清华大学大型仪器设备使用效益 三等奖
  - 16032332 电镜配套存储系统集群（阮华斌、陈晋红、王亚坤、**唐贺**）
- 2024 清华大学大型仪器设备使用效益 二等奖
  - 16032332 电镜配套存储系统集群（**唐贺**、阮华斌、贾安宝、陈晋红）
- 2023 清华大学大型仪器设备使用效益 三等奖
  - 14005375 生物信息重点实验室数据分析和仿真模拟系统（阮华斌、王亚坤、**唐贺**）
  - 16031323 300KV冷冻电镜一体化数据深度解析系统（**唐贺**、贾安宝、陈晋红）
- 2021 清华大学大型仪器设备使用效益 三等奖
  - 18502333 冷冻电镜第二期扩展集（贾安宝、陈晋红、**唐贺**）
- 2024 中国高校算力优秀案例奖
  - 生物计算平台冷冻电镜流水线系统（杨涛，**唐贺**，王亚坤，陈晋红，贾安宝，户军雷）
- 2023 中国高校算力优秀案例奖
  - 生物计算平台机房建设案例（杨涛，**唐贺**）

### 基金项目

- 2025 清华大学实验室创新基金
  - 基于生命校级平台日常语料的智能问答系统（负责人：杨涛、马剑竹，参加人：徐艳姬、**唐贺**、阮华斌、李栋庭、贾安宝）
- 2023 清华大学实验室创新基金
  - 一种内存层面的冷冻电镜压缩数据解压和解析展示技术（负责人：杨涛，参加人：**唐贺**、陈晋红）
- 2019 清华大学实验室创新基金
  - 一种集群实时监控及企业微信异常报警机制（负责人：杨涛，参加人：王亚坤、**唐贺**、陈晋红、贾安宝）
- 2019 生物信息学教育部重点实验室开放课题
  - 生物信息小碎数据的高速压缩和转储研究（杨涛、阮华斌、**唐贺**）

### 软件著作

- **唐贺**,许丽娜,刘晓蕙,杨涛. 一种生物实验数据检索展示网站平台: 2024SR0068365
- **唐贺**,杨涛,户军雷,陈晋红. 集群内外网隔离直播监控技术及运维: 2024SR1197896

### 期刊论文

- Yang, X., Xiao, Z., Wu, X., Xing, K., **Tang, H.**, Yang, T., et al. Improving Password Guessing with Isomorphism Modeling. IEEE Transactions on Information Forensics and Security, (2025)
- **唐贺**,杨涛,阮华斌.基于OKR的生物计算平台管理.实验室研究与探索, 2023, 42(6): 253-256
- 陈晔光,杨涛,**唐贺**.我国当前高等院校成果转化体系状况之调研与思考.民主与科学, 2019(3):4
- Yan, Y., Zhang, L., Yu, M., Wang, J., **Tang, H.**, et al. The Genome of Bacillus Aryabhattai T61 Reveals its Adaptation to Tibetan Plateau Environment. Genes & Genomics, (2016). 38(3):293-301.

### 会议论文

- 杨涛,**唐贺**. 一种基于内存的冷冻电镜压缩数据读取展示方法[C]. HPC China 2025, 2025, 201-208.
- 阮华斌,杨涛,**唐贺**. PB量级冷冻电镜数据压缩存储方法[C]. HPC China 2024, 2024, 4-15. (会议优秀论文)

### 发明专利

- **唐贺**,万平.一种植物叶片照片的气孔识别方法及装置:CN201710712583.4[P]
- 阮华斌,杨涛,**唐贺**,陈晋红.一种内存访问管理方法和系统:CN202111078307.X[P]
- 徐运昕,许丽娜,刘晓蕙,**唐贺**,杨涛. 一种化合物名称的检索方法和装置:CN02311823641.2[P]
- 阮华斌,韩文静,杨涛,**唐贺**等. 冷冻电镜数据智能自动处理方法和装置:CN202311406886 .5[P] (实质审查)`,
                category: "记录",
                date: "2026-02-12",
                tags: []
            },
            {
                id: 6,
                title: "保洁员与经理",
                excerpt: "这是一件小事。",
                content: `这是一件小事。

一日，我去上办公室旁边的卫生间，不远处楼宇的物业经理正在给手下的保洁阿姨开晨会。

恰好我要去掀开厕所进门的门帘时，帘子的一端掉了下来。

正在我抬头看这个半悬着的门帘时，一个在远处正在开会的保洁阿姨向我喊道：“老师，您帮忙挂上。”。

在我尴尬之时，远处的经理慌忙的制止了那位保洁阿姨，并向我道歉：“您不用管，我们来我们来。”

“小伙子个子高嘛”，那位保洁阿姨解释道。

“不不，小伙子，您不用管。”

当然我没有去挂这个门帘，就去忙我的了。

保洁阿姨只是从自己的角度来看待这个事情，觉得这是一件求人帮助的小事，当然我帮着挂上也没有问题。

但在那位经理的角度则是另外一回事，身为物业的管理者，怎么可能让物业人员指使业主来做自己份内的工作。

不同人不同角度。

但为什么有人能当经理，也许就是她能多考虑一层吧。`,
                category: "感悟",
                date: "2021-04-09",
                tags: []
            },
            {
                id: 5,
                title: "为人处世与回头路",
                excerpt: "衡量一个人的为人处世方式是不是恰当，往往可以从他时候还能走回头路体现出来。",
                content: `衡量一个人的为人处世方式是不是恰当，往往可以从他时候还能走回头路体现出来。

以下两件事，让我深深的反思这些年我的为人处世方式。

### 回校

我和我的爱人是同一所初高中的校友，虽然在学校里都没有见过面，但我们缘起那所学校，所以在这里求婚在我的计划之中。

当然我跟她第一次见面是在15年前，去学校的路上，我们都住在同一个小镇有一条铁路，也是在绿皮火车上我第一次见到了她，我也想过在火车上向她求婚，但是现在都改为动车了，找不回绿皮火车的那种感觉了。

因为疫情的缘故，回那所学校要与校内的老师联系，由他为你预约才能进校。

所以我鼓起勇气加了10多年没见班主任的微信，当然这10多年我也在没有回过那所学校。

寒暄几句我并没有提出这个请求，因为时间上还没有安排。

几天后的早上我向他提出了想预约进校的请求，然而知道晚上都没有收到任何回复，我便硬生生的对他告谢，过了一会他回复我表示歉意，那天他要去体检不在学校。

当然，我知道这都是借口，对他再次告谢后，告知他我进校的目的，便再也没有理会他。

收到了这样的待遇心理当然很不是滋味，身为校友不能回母校，在那所学校的那6年我过得一点都不好，甚至是我最黑暗的6年，当然与班主任们的关系都处的不好，说实话我也没脸回校。

### 导师

当硕士导师将我从他的微信好友中删除的时候，我知道我已经不是他的学生了。

我在这里不去评判我们之间事情谁对谁错，但我的为人处世一定是有问题的。

我的导师是个人很nice的人，对所有人体恤入微，对我更是这样。

现在回想起来，有太多事做的相当差劲。

如果我能回到当初，我绝对不会这么做。

现在中学和大学我都不想回去，也是没脸回去。

当你把路走的越来越窄的时候，能得到的帮助也越来越少。

当你连你走过的路都没法走的时候，你的为人处世一定是有问题的。`,
                category: "感悟",
                date: "2021-03-09",
                tags: ["回忆"]
            },
            {
                id: 4,
                title: "从追到小学班花说起",
                excerpt: "小学班里有个几乎班里男生都喜欢的女孩。",
                content: `小学班里有个几乎班里男生都喜欢的女孩。

当然，我追到手了，只不过我们只是小学生那种纯真喜欢在一起。

你喜欢我我喜欢你，那时还没有手机，只有家里的座机。

就这样每天晚上我们都会偷偷的给对方打电话，那时候家长晚上都会去遛弯，谁的家长出去了，就给对方家里电话响一声做暗号，等对方方便了就给打回来。

然后我们就会一直煲电话粥，直到听到家长上楼的脚步声。

想想那时真的好甜，虽然我们手都没有牵过，但是真的好喜欢她。

一晃都20多年过去了，还是会时常的回想起来，那段时光真的好美好，不知道她还会回想么。

那时候怎么追到的她，真的可以写出来，因为追女生我总结出以下三条：

1. 自己足够优秀
2. 她对你有好感
3. 足够的勇气

### 自己足够优秀

我小学的时候发育的早长得高，班里第二高。

学习好年级第一，门门考试100分，我说我是第二名没有人敢说自己第一名的那种。

我姑是学校老会计，跟校长熟，我自然跟学校领导老师们都熟，后台关系硬。

硬伤是不够帅。

### 她对你有好感

她对你有好感这你应该是能感觉出来的，也许是占了自己足够优秀的光。

女生对你有好感是跟重要的，最低要求是对你不反感，这点很重要。

### 足够的勇气

要勇敢的表白！话说我怎么表白的真有的一说！

那时候我个子高坐在最后一排，她坐在第二排。

结果我近视了......爸妈带我去同仁看眼睛，期间看不清黑板的字，爸妈就跟老师说了我的情况，让我往前坐一些。

当时我就盘算着要是跟她坐同桌就好了，我就跟她说我要跟她坐同桌了，她自然不信的。

然后然后我的脑子就瓦特了，直接来到班主任的办公室找到老师，开门见山的说：老师，我眼睛近视看不清，我想往前调座位，坐到XX的旁边！

那时我那个心跳啊！我那个热啊！

出乎意料的是，老师竟然同意了！

话说我现在都回想不起我是咋回到班里，咋跟别人换的座位了。

自此我们就默认了彼此。

之后我在班里就多了一个外号：色狼大队长......

花有重开日 人无再少年

现在每当聊起女孩子，我都会回忆起这段青涩的记忆。

有很多东西一旦错过了，就真的错过了，真的好想再回到以前，好好珍惜。

等我有儿子了，我一定会把老爸这个经历讲给他听，把我总结的这个追女生三条经验传授给他。

抓住，珍惜，不留遗憾。`,
                category: "感悟",
                date: "2020-08-06",
                tags: ["回忆"]
            },
            {
                id: 3,
                title: "该说就要说出来",
                excerpt: "我是个特别腼腆的人，在与陌生人，甚至是认识的人说话都会紧张，更别说是人多的时候。",
                content: `我是个特别腼腆的人，在与陌生人，甚至是认识的人说话都会紧张，更别说是人多的时候。

记得在读硕士的时候，参加了一场车库咖啡的活动，演讲人是一位来自以色列的犹太人。

演讲中过程中演讲者放了一个视频，很多以色列人门在沙滩上用球拍进行类似羽毛球的运动。

与此同时，演讲者解释道，“这项运动是我们以色列最流行的运动，这也是我们国家创新的秘密，请大家猜猜这项运动为什么与众不同”。

为了更好地提示大家，演讲者拿出了视频中的球拍。

起初坐在底下的听众都在左右观望，没有人好意思张口。

在演讲者的鼓励下，听众开始踊跃参与，有说球场上没有边界的，有说没有裁判的等等，但谁也没有说对。

而我早已经有了答案，“**没有输赢**”。

尽管我知道我的答案肯定是对的，甚至连答对后演讲者要问我什么，以及我怎么风趣的回答都脑补出来了：

> 「演讲者：“You are right,clever boy! Now, this No Win No loss racket is belong to you!”」
> 「我：“Thanks, and now I think i am win!”」

但我始终没有举手，此时我的心早已砰砰的跳。

最终谁也没有说出正确答案，演讲者失望的公布了答案，“**No Win, No Loss**”，与此同时收起了那副球拍。

这件事给我的感触很深，从小到大很多机会可能就是这么错过的，如果不去改变，未来会错过更多。

今年11月28日，我去五棵松看林书豪，在第三节他发球的时候，我想鼓动大家一起为他喊“MVP”，但是没有人响应我。

“MVP！”，他们不喊我喊！谁让他是我的偶像呢！

要是以前的我，是绝对喊不出来的。

喊出这声后，下次再喊好像放得更开了。`,
                category: "感悟",
                date: "2019-12-08",
                tags: ["回忆"]
            },
            {
                id: 2,
                title: "请示领导",
                excerpt: "前几日领导跟我聊起面试新员工的事。",
                content: `前几日领导跟我聊起面试新员工的事。

有一个他感觉还不错，小伙子能说会道，创过业，“忽悠”过投资人。

正好领导想要一个能帮他到外面发言的，只不过他学历不够被卡了。

聊天过程中，老板有些担心他与老师学生在沟通上发生冲突，毕竟给领导的感觉，这小伙说话太冲。

遂领导问了他一个问题，“如果你跟学生在观点或者意见上发生了不一致，怎么办？听谁的？”

他的回答大概是：“大原则上的问题不妥协。”

领导对这个回答不满意，遂对我说，“你知道我最想听到的回答是什么吗？”

几秒懵逼的我，愣是没想出怎么答...

“**请示领导**。”`,
                category: "感悟",
                date: "2019-10-28",
                tags: ["职场"]
            },
            {
                id: 1,
                title: "记一次失败的投资",
                excerpt: "都说人的一生只有几次发财的机会。那么我毋庸置疑错过了第一次，真的是攥在手里让我生生放走的。",
                content: `都说人的一生只有几次发财的机会。那么我毋庸置疑错过了第一次，真的是攥在手里让我生生放走的。

那就是**比特币**。

我是从15年比特币在2000多人民币的时候开始关注的。

在新闻中得知这个东西刚刚问世时暴涨到过8000多人民币。

但当时也没想过要靠这玩意发财，只是跟大多数极客一样觉得它很cool和geek！

所以还在读硕士的我又开始不务正业的研究起这玩意儿了，又是看白皮书、又是研究算法的。

就这样一直研究了1年多的时间。

终于在2016年6月21日，我买入了第一枚比特币（0.001BTC），就这样我开启了比特币的投资故事。

当时我的投资策略是以周为单位**小量持续定投**，考虑如下：

1. 比特币总量是2100万枚，由算法决定，且是固定不变。正是由于这种稀缺性，会导致其在长期上价值上涨
2. 比特币在短期内波动会很大，有没有涨跌停限制，所以定投是很好的策略，可以将定投周期设定的很小，故以周为单位小量长期定投
3. 由于其存在创新性，会得到广泛的关注，肯定会有爆发点，但具体时间不能确定
4. 由于比特币存在着监管风险，故没有将资金重点投入其中，只是小量持续定投策略
5. 其上涨后会经过一段时间的波动，回想一种真正的货币是的，存在一种稳定的汇率，投机性不再存在

就这样，定投策略一直持续了5个多月。

后面的事情就不用说了。

可是我在8000多块的时候全部清仓了，卖出时连说三遍，“卖出后不管涨跌都跟我无关”。

就这样结束了比特币的投资，不怕笑话，一共只赚了400多块。

反思：

1. **国家越是政策不明朗的事情、灰色的地带、越不让你干的事情，往往千倍万倍的投资机会就在里面**
2. **投资要有魄力。当时我将我父亲都说的心动了，他让我投个2万进去，但是担心政策不明朗，没有听从这个建议。做事要有魄力，拿出2万块钱，全当赔进去，要有这种心态做投资，我的第一桶金就整出来了**
3. **让你财富自由的投资机会屈指可数，这次错过，下次是啥时候就不得而知了，一定要看明白了、想清楚了、稳准狠的拿下它**
4. **不要贪小利，千倍万倍的投资机会不是赚一倍就跑的，当投机来的时候，赶机会买入还是有时间的**`,
                category: "投资",
                date: "2019-07-01",
                tags: ["比特币"]
            },
        ];
